; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - locatable
	locatable city flevel - object)
(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-1-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl0)
	(at person1 city2)
	(at person2 city1)
	(at person3 city0)
	(at person4 city2)
	(at person5 city1)
	(at person6 city0)
	(at person7 city0)
	(at person8 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city2)
	(at person2 city2)
	(at person3 city1)
	(at person4 city2)
	(at person5 city0)
	(at person6 city1)
	(at person7 city1)
	(at person8 city2)
	))

)

; plan
1. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 2 of 8
2. (refuel plane1 city2 fl1 fl2)
   deleted: (fuel-level plane1 fl1)
   added: (fuel-level plane1 fl2)
   goals met: 2 of 8
3. (fly plane1 city2 city0 fl2 fl1)
   deleted: (at plane1 city2) (fuel-level plane1 fl2)
   added: (at plane1 city0) (fuel-level plane1 fl1)
   goals met: 2 of 8
4. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   goals met: 2 of 8
5. (board person7 plane1 city0)
   deleted: (at person7 city0)
   added: (in person7 plane1)
   goals met: 2 of 8
6. (board person6 plane1 city0)
   deleted: (at person6 city0)
   added: (in person6 plane1)
   goals met: 2 of 8
7. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   goals met: 2 of 8
8. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 2 of 8
9. (debark person7 plane1 city1)
   deleted: (in person7 plane1)
   added: (at person7 city1)
   goals met: 3 of 8
10. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   goals met: 4 of 8
11. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   goals met: 5 of 8
12. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   goals met: 5 of 8
13. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   goals met: 5 of 8
14. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 5 of 8
15. (fly plane1 city1 city0 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 5 of 8
16. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   goals met: 6 of 8
17. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 6 of 8
18. (fly plane1 city0 city2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 6 of 8
19. (debark person2 plane1 city2)
   deleted: (in person2 plane1)
   added: (at person2 city2)
   goals met: 7 of 8
20. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   goals met: 8 of 8
